****** btrfs subvolume

http://www.grymoire.com/Unix/sed.html

#+HEADERS: :results raw
#+BEGIN_SRC sh

  mount  | awk '$3 ~ /^\/$/ {print $NF}' | sed 's/.*subvol=\/\(.*\))/\1/'
# mount  | awk '$3 ~ /^\/$/ {print $NF}' | sed 's/.*subvol=\/\(.*\)/\1/'

# mount | awk '$3 ~ /^\/$/ {print $NF}' # | awk 'BEGIN{ FS="[,]"} {print $NF}'  
# mount | awk '$3 ~ /^\/$/ {print $NF}' # | awk 'BEGIN{ FS="[,]"} {print $NF}'  

#+END_SRC

#+RESULTS:
fs2/snapshot20160210
fs2/snapshot20160210)
(rw,noatime,compress=lzo,noacl,space_cache,autodefrag,inode_cache,subvolid=263,subvol=/fs2/snapshot20160210)
(rw,noatime,compress=lzo,noacl,space_cache,autodefrag,inode_cache,subvolid=263,subvol=/fs2/snapshot20160210)

****** root device

#+HEADERS: :results raw
#+BEGIN_SRC sh

mount | awk '$3 ~ /^\/$/ {print $1}' | awk 'BEGIN{ FS="[/]"} {print $3}'

#  mount #| awk '$3 ~ /^\/$/ {print $1}'   | awk 'BEGIN{ FS="[/]"} {print $3}'
#  mount  | awk '$3 ~ /^\/$/ {print $1}' # | awk 'BEGIN{ FS="[/]"} {print $3}'
#  mount  | awk '$3 ~ /^\/$/ {print $1}'   | awk 'BEGIN{ FS="[/]"} {print $3}'

#+END_SRC

#+RESULTS:
sdb



** 90 

#+HEADERS:  :dir /su::/tmp
#+HEADERS: :results raw

#+HEADERS: :results silent
#+HEADERS: :dir /tmp
#+BEGIN_SRC sh

date

#+END_SRC

#+RESULTS:
Thu Jul  6 11:56:55 CST 2017



#+HEADERS: :dir /tmp
#+BEGIN_SRC sh

date
#pwd

#+END_SRC

#+RESULTS:
: Thu Jul  6 11:57:45 CST 2017

